package com.example.wutai.wutaimoutain;

import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.Toolbar;
import android.view.View;
import android.widget.ImageView;
import android.widget.TextView;

import com.bumptech.glide.Glide;
import com.github.clans.fab.FloatingActionButton;

import java.io.InputStream;

public class Wutaijianjie_activity extends AppCompatActivity implements View.OnClickListener{
    private TextView title,content1,conten2,conten3;
    private ImageView img1,img2,img3;
    private FloatingActionButton wutai,dizhi,lishiyange,ziran,renewn,lvyou,lishichuanshuo,cankaozilaio,qihou;
    private Toolbar toolbar;
    private String title1,
            wutai1,wutai2,wutai3,
            dizhi1,dizhi2,dizhi3,
            qihou1,qihou2,
            lishiyange1,lishiyange2,lishiyange3,
            ziran1,ziran2,ziran3,
            renewn1,renwen2,renwen3,
            lvyou1,lvyou2,lvyou3,
            lishichuanshuo1,lishichuanshuo2,lishichuanshuo3,
            cankaozilaio1;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.wutaijianjie);
        initview();
        toolbar = (Toolbar)findViewById(R.id.stroy_toolbar_1);
        setSupportActionBar(toolbar);
        toolbar.setNavigationIcon(R.drawable.ic_back_wuta);
        toolbar.setNavigationOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                finish();
            }
        });
        wutai.setOnClickListener(this);
        dizhi.setOnClickListener(this);
        ziran.setOnClickListener(this);
        lishichuanshuo.setOnClickListener(this);
        lishiyange.setOnClickListener(this);
        renewn.setOnClickListener(this);
        lvyou.setOnClickListener(this);
        cankaozilaio.setOnClickListener(this);
        qihou.setOnClickListener(this);
    }
    public void setvisib(){
        content1.setVisibility(View.VISIBLE);
        conten2.setVisibility(View.VISIBLE);
        conten3.setVisibility(View.VISIBLE);
        img3.setVisibility(View.VISIBLE);
        img2.setVisibility(View.VISIBLE);
        img1.setVisibility(View.VISIBLE);
    }
    public void initview(){
        title = (TextView)findViewById(R.id.title_wuati);
        content1 = (TextView)findViewById(R.id.text_stage1);
        conten2 = (TextView)findViewById(R.id.text_stage2);
        conten3 = (TextView)findViewById(R.id.text_stage3);
        img1 = (ImageView)findViewById(R.id.img_stage1);
        img2 = (ImageView)findViewById(R.id.img_stage2);
        img3 = (ImageView)findViewById(R.id.img_stage3);
        wutai = (FloatingActionButton)findViewById(R.id.zongjianjie);
        dizhi = (FloatingActionButton)findViewById(R.id.dizhidimao);
        lishiyange = (FloatingActionButton)findViewById(R.id.lishiyange);
        ziran = (FloatingActionButton)findViewById(R.id.ziranziyuan);
        renewn = (FloatingActionButton)findViewById(R.id.renwenlishi);
        lvyou = (FloatingActionButton)findViewById(R.id.lvyouxinxi);
        lishichuanshuo = (FloatingActionButton)findViewById(R.id.lishichuanshuo);
        cankaozilaio = (FloatingActionButton)findViewById(R.id.cankaoziliao);
        qihou = (FloatingActionButton)findViewById(R.id.qihoutedian);
        wutai1 = "五台山(MountWutai)位于山西省忻州市五台县境内,位列中国佛教四大名山之首。五台山位于山西省东北部,隶属忻州市五台县,西南距省会太原市230公里,与浙江普陀山、安徽九华山、四川峨眉山、共称“中国佛教四大名山”" ;
        wutai2 = "五台山与尼泊尔蓝毗尼花园、印度鹿野苑、菩提伽耶、拘尸那迦并称为世界五大佛教圣地。最早在五台山弘扬佛法的是光明法师桑王澳登(第三代伏藏法王生根活佛),于公元前710年亲自赴五台山传播佛教。《名山志》记载:“五台山五峰耸立,高出云表,山顶无林木,有如垒土之台,故曰五台。";
        wutai3 = "五台山所在的山西处于黄土高原,地旱树稀,视野里整整一个是土黄色的世界,可以称为金色世界。五台山属太行山系的北端,跨忻州市五台县、繁峙县、代县、原平市、定襄县,周五百余里。在北纬38°50'~39°05'、东经113°29'~113°44'之间,由一系列大山和群峰组成。其中五座高峰,山势雄伟,连绵环抱,方圆达250公里,总面积592.88平方公里。";



        dizhi1 = "五台山地层完整丰富,特别是前寒武系地层典型奇特,是中国地质科考的重点地区。五台山境内的绝大部分地层组段,都是以该地区的山、水、村、镇命名的,它们在地质学领域具有重要的位置和作用。\n" +
                "五台山由古老结晶岩构成,北部切割深峻,五峰耸立,峰顶平坦如台,故称五台︰东台望海峰、西台挂月峰、南台锦绣峰、北台叶斗峰、中台翠岩峰。五峰之外称台外,五峰之内称台内,台内以台怀镇为中心。五台周长约250公里,总面积2837平方公里。五台之中以北台最高,北台顶海拔3061.1米,有“华北屋脊”之称。山中气候寒冷,台顶终年有冰,盛夏天气凉爽,故又称清凉山,为避暑胜地。五台山自然植被以草地为主,由草甸、草原、灌丛构成,是优良的夏季牧场。";
        dizhi2 ="五台山地质古老,地貌奇特,是著名的国家地质公园。五台山地处华北大陆的腹地,与恒山—太行山连续,相对高差达2400多米,大面积出露了地壳不同层次的岩层和地质构造,完美展示出中国大陆基底的地质构造和地质组成,是由大于25亿年的世界已知古老地层构成的最高山脉。在漫长的地球演进中,五台山经过了“铁堡运动”、“台怀运动”、“五台运动”、“燕山运动”,形成了以“五台群”绿色片岩及“豆村板岩”构成的“五台隆起”,具有高亢夷平的古夷平面、十分发育的冰川地貌、独特的高山草甸景观,更有第四纪冰川及巨大剥蚀力量造成的“龙磐石”、“冻胀丘”等冰缘地貌的奇观。";
        dizhi3 ="可以说,五台山拥有独特而完整的地球早期地质构造、地层剖面、古生物化石遗迹、新生代夷平面及冰缘地貌,完整记录了地球新太古代晚期—古元古代地质演化历史,具有世界性地质构造和年代地层划界意义和对比价值,是全球地质科学界研究地球早期演化以及早期板块碰撞造山过程的最佳记录,是开展全球性地壳演化、古环境、生物演化对比研究的典型例证。因此,五台山当之无愧地被誉为“中国地质博物馆”。" +
                "我的手机 2018/8/9 21:01:45" +
                "　五台山最低处海拔仅624米,最高处海拔达3061.1米,为山西省最高峰,有“山西屋脊”之称。台顶雄旷,层峦叠嶂,峰岭交错,挺拔壮丽,大自然为其造就了许多独特的景观。";
qihou1 ="五台山气候寒冷,又被称作“清凉山”。虽然处于与北京大致相同的纬度,但气候特征却和中国东北部的大兴安岭差不多。全年平均气温为零下4度,7至8月最热,分别为9.5度和8.5度,1月份最冷,平均气温零下18.8度。台怀地区比台顶早一个月入春,迟一个月入秋,温度相差6度左右,全年平均气温2-3度,最低气温零下30度,最高气温为30度。台怀地区夏季空中云层较低,湿度大,常有雨水";
qihou2 ="五台山地区夏季湿度大,常有雨水,4月以前和11月以后,高入云端的公路有可能被积雪封堵,难以通行。冬季的五台山,既冰冻雪寒,又宁静美丽,与其他季节截然不同,充满另外一种风情,虽然时有风暴、大雪。";
lishiyange1="很多与五台山有关的古籍和志史中都有记载,五台山原来是修炼道教的人居住之地。\n" +
        "　　如《仙经》云:“五台山,名为紫府,常有紫气,仙人居之。”\n" +
        "　　《六贴》云:“银宫金阙,紫府青都,皆是神仙所居。”\n" +
        "　　《大唐神州感通录》云:“代州东南,有五台山者,古称神仙之宅也。山方五百里,势极崇峻。上有五台,其顶不生草木。松柏茂林,森于谷底。其山极寒,南号清凉山,山下有清凉府。经中明说,文殊将五百仙人住清凉雪山,即斯地也。所以,古来求道之士,多游此山。灵踪遗窟,奄然在目,不徒设也。”\n" +
        "　　《括地志》云:“其山层盘秀峙,曲径萦纡,灵岳神溪,非薄俗可栖。止者,悉是栖禅之士,思玄之流。”等等。\n" +
        "　　直至西晋末年,五台山仍被人们看成仙都。如唐释慧祥《古清凉传》卷上云:“晋永嘉三年,雁门郡葰人县百余家避乱入此山,见山人为之步驱而不返,遂宁居岩野。往还之士时有望其居者,至诣寻访,莫知所在,故人以是山为仙者之都矣。”\n" +
        "作为清凉圣地、紫府名山的五台山,异花芬馥,幽石莹洁,苍岩碧洞,瑞气萦绕,时令高人远访,贵族亲临,并且流传着不少与道教有关的说。";
lishiyange2="据明代释镇澄著《清凉山志》卷四载《五髻仙人传》云:“汉明以前,声教未至,台山圣境,闻者尚希,况造者乎!当是时,五百里内,林木茂密,虎豹纵横,五峰无路,人迹罕通。其川原之处,皆黄冠所居。每望五峰之间,祥光焕发,神灯夜流,皆以为神人之都。自古相传,有仙人者,发结五髻,衣挂三铢。或独一无侣,或群儿相逐,游行五顶间,望之俨然,近之则失。或出或入,人莫追寻。或云周时即在此山,或云莫穷其始。后来人迹渐繁,其出渐少。当时黄冠,目为素衣仙。及腾兰开山后,遂不复现。《三晋异记》云:‘无恤登常山,西瞻紫云之瑞,疑雁代间有王气。因猎于五台之阿,倏而云淡若水,见神人焉。衣素,容若金,俨若熙若。占之,蔬祭吉,遂罢猎而返。’后《宝藏经》至,乃知五髻童子,文殊化身也。”\n" +
        "　　又《清凉山志》卷二载,元魏永安二年,恒州刺史延庆因狩猎至东台之东北,仆夫四人追逐一只白鹿时,偶然看见一大宅高门,白鹿即窜进大门里。有一长者,须发皓然,柱杖而立,说白鹿是我家所有,你们为何随意乱追逐它。仆夫们说我们追不到鹿,又饥又困可怎么办。老翁于是指点他们去东边的枣林,那时枣子刚熟。仆夫四人在枣林里吃饱后,用行囊装了一包枣子给延庆吃。延庆觉此事颇奇怪,于是又循原路寻找,却再也找不到了。卷七载,唐朝孝子李思逊,山东人,他曾背负八十岁的老母亲游五台山。第二年,他母亲去世了,李思逊因非常思念自己的母亲,为报母恩一步一礼至五台山北台麓结庵修道。不久,有异人授灵药。他服食灵药后,辞别好友僧人道一,羽化而去。后人称其居室为仙人庵。又载唐景龙年间,代州人谢平,在五台山东台麓遇见一老叟,招他进入深谷之中。只见川原清畅,花木秀茂,茆茨石室,诸仙所居。谢平采薇而食,其味冲澹,了无茹退,血气优柔,不思嗜欲。谢平住了一段时间,开始想念亲人,于是采薇装了一包回家给母亲吃。当时他母亲快病死了,吃了之后不久病就好了。谢平在家住了三个月又回到仙人所居之处,人们从此再也没有见过他。等等。";
lishiyange3 ="五台山仍存留着一些与道教传说有关的遗迹,这些遗迹让古往今来的游客们留下了不少感怀诗文。如大白塔南1公里处,有座高约百余米的梵仙山,山顶上坐落着一座现主要供奉胡仙的大仙庙。梵仙山上青松成林,鲜花烂漫,据《清凉山志》载,昔有五百仙人,在此饵菊成道。觉玄有诗怀之曰:“山头紫气日长浮,上有仙人汗漫游。饵菊换教风骨异,白云影里去悠悠。”[45]五台中的南台,亦名仙花山,唐代禅师普明曾于南台之北凿龛修行,著有诗《南台歌》曰:“南台之麓,仙人之居。春云霭霭,暮雨霏霏。卧于石罅,而坐神龟,杳然飞去,仙花披靡。”\n" +
        "　　镇澄诗曰:“西望龙泉锦绣开,紫云郁郁锁仙台。就中一片清凉地,劫火曾经几度来。”" +
        "　　觉玄咏北台仙人庵诗曰:“何年仙子此修行,服日餐霞道气清。袖拂天风骑鹤去,至今传说有庵名。”等等。" +
        "　　九华山、普陀山、峨眉山、五台山中多姿多彩的道教文化现象,为这四座以佛教文化为主要内容的佛教名山增添了许多古雅的文化气息,也为宗教学、方志学、文学、史学等多方面的学术研究提供了很好的素材,对促进佛教四大名山旅游事业的发展也有很多的好处";
ziran1 ="五台山与众不同的五个台顶,形成独特的自然奇观,并且由于类型繁多的冰缘地貌、地质地貌的多样性,造就了五台山生物的多样化,其植被分布具有明显的垂直地带性,形成罕见的自然美地带。\n";
ziran2="区域内植物五百九十五种,种类繁多。金莲花、迎红杜鹃,被专家认定为中国独有。山中活动着众多的动物飞禽,其中有国家一级保护动物金雕等。昆虫学家还在这里发现了二十多种昆虫新种。\n" +
        "\n" +
        "我的手机 2018/8/9 21:10:57\n" +
        "五台有多种颜色的黑曜石矿山,确定是多种颜色曜石,已经开采,且储量惊人。有重大经济价值。";
renewn1="五台山是中国佛教寺庙建筑最早的建造地之一。自东汉永平(公元58年~75年)年间起,历代修造的寺庙鳞次栉比,佛塔摩天,殿宇巍峨,金碧辉煌,是中国历代建筑荟萃之地。雕塑、石刻、壁画、书法遍及各寺,均具有很高的艺术价值。\n" +
        "　　传说五台最早是道家的地盘,《道经》里称五台山为紫府山,曾建有紫府庙。《清凉山志》称佛教的文殊菩萨初来中国时,居于石盆洞中,而石盆在道家的玄真观内,这说明当时五台山为道家所居。\n" +
        "　　汉师桑王澳登(第三代伏藏法王生根活佛)于公元前710年左右,在象雄四种耳传大师热桑持拉克求学四种耳传和三种大圆满等各种象雄本波佛教法,然后赴峨眉山、五台山等汉地传播发展本波佛教,把象雄佛法耳传和正见法翻译成汉文,桑王澳登大师是最初在汉地传教耳传法门的,汉名叫做光明法师,他的弟子犹如尘沙一般多,他很多汉族的教徒弟子们都是降阳光而成就的,也就是虹光身。大师83岁时在汉地圆寂,圆寂时全身变成虹化。遗憾的是他所传的法后来在汉地失传了。生根活佛曾亲自赴峨眉山、五台山等地传播佛教,将佛法传到了汉地,是最早在汉地弘扬佛法的高僧。历史上他是汉地第一位虹化身大成就者。\n" +
        "　　佛教最初传入中国时,只有少数人奉行。公元前二年,大月氏国(原居中国新疆西部伊犁河流域的少数民族,西迁中亚后建立的国家)国王的使者伊存来到当时中国的首都长安(即今西安),他口授佛经给一个名叫卢景的博士弟子,这是中国史书上关于佛教传入中国的最早记录。\n";
renwen2="佛教传入五台山,普遍的说法是始于东汉。史籍记载,永平十年(公元67年)十二月,汉明帝派往西域求法的使者同两位印度高僧迦叶摩腾和竺法兰来到洛阳。\n" +
        "　　永平十一年在洛阳城西雍门外御道之南,建造一座僧院以供这两位印度高僧居住。为纪念白马负经(《四十二章经》)输像(佛像)之功,因名白马寺。\n" +
        "　　永平十一年,迦叶摩腾、竺法兰从洛阳来到了五台山(当时叫清凉山)。由于山里很早就有阿育王的舍利塔,再加上五台山又是文殊菩萨演教和居住的地方,他二人想在此建寺,但由于当时五台山是道教根据地,他二人颇受排挤,因此奏知汉明帝。汉朝廷为辨别佛教与道教的优劣高下,让僧人与道士表演、说明、验证,因此双方达成协议——约期焚经,以别真伪(相传,焚经地点在今西安焚经台)。焚经的结果,道教经文全部焚毁,佛教经文却完好如初,故他二人获得建寺的权利。\n" +
        "　　台内山多地广,河流纵横,选址建寺很重要。《清凉山志》载:“在大塔左侧,有释迦牟尼佛所遗足迹,其长一尺六寸,广六寸,千幅轮相,十指皆现”。相传他二人不仅发现此足迹,而且还发现佛“舍利”,此外,营坊村这座山的山势奇伟,气象非凡,和印度的灵鹫山(释迦牟尼佛修行处)相似。由于这三种原因,故决定在此建寺。寺院落成后,以其山形命名为灵鹫寺。汉明帝刘庄为了表示信佛,乃加“大孚”(即弘信的意思)两字,因而寺院落成后的全名是大孚灵鹫寺。大孚灵鹫寺是显通寺的前身。从那时起,五台山开始成为中国佛教的中心,五台山的大孚灵鹫寺与洛阳白马寺同为中国最早的寺院。\n" +
        "　　南北朝时期,五台山佛教的发展出现第一个高潮。北魏孝文帝对灵鹫寺进行规模较大的扩建,并在周围兴建了善经院、真容院等十二个寺院。北齐时,五台山寺庙猛增到二百余座。\n";
renwen3="到了隋朝,隋文帝又下诏在五个台顶各建一座寺庙。即东台望海寺、南台普济寺、西台法雷寺、北台灵应寺、中台演教寺。也因为五台山是文殊菩萨演教的地方,所以这五个台顶上的寺庙均供奉文殊菩萨,但五个文殊的法号不同:东台望海寺供聪明文殊、南台普济寺供智慧文殊、西台法雷寺供狮子吼文殊、北台灵应寺供无垢文殊、中台演教寺供孺童文殊。从此以后,凡到五台山朝拜的人,都要到五个台顶寺庙里礼拜,叫做朝台。此时,五台山之名已在北齐史籍中大量出现。\n" +
        "　　盛唐时期,五台山佛教的发展出现了第二个高潮。这个期间据《古清凉传》,全山寺院多达三百所,有僧侣三千余人。此时的五台山,不仅是中国著名的佛教名山之一,而且是名符其实的佛教圣地了,被誉为中国佛教四大名山之首。这是五台山在中国佛教界取得统治地位的发端,也是五台山在封建统治者的利用和主持下,发展成为名山圣地的开始。\n" +
        "　　在唐代,佛教备受推崇,文殊菩萨尤其为佛教徒所尊崇。当时国家规定,全国所有寺院的斋堂,都必须供奉文殊菩萨圣像。由于朝野都尊奉文殊菩萨,视五台山为佛教圣地,所以五台山空前隆盛,名僧辈出,澄观就是一个突出的代表。\n" +
        "　　随着佛寺的兴建和扩大,五台山的僧侣人数亦日益增多。唐德宗贞元年间,合山僧尼达万人之众。寺院的兴旺发展引起对社会政治、经济的重大负面影响,唐文宗遂于会昌五年(公元854年)下诏废佛,命令拆毁寺字,勒令僧尼还俗。综计中国拆毁大小寺庙四万四千六百余所,僧尼还俗二十六万余人,收回土地数千万顷。五台山亦不例外,僧侣散尽,寺庙被毁,史称“会昌灭佛”。唐宣宗即位,又再兴佛教。政府规定五台山的僧数仍达“五千僧”。实际上,加上私度和游方僧,要比“五千僧”多得多。纵观历代五台山的僧侣人数,以唐代为最多。寺庙林立,僧侣若云,这也是唐代五台山佛教圣地形成的一个标志。\n" +
        "　　唐代五台山佛教圣地形成的另一个标志,是外国佛教徒对五台山的无限景仰和竞相朝礼。唐朝经济繁荣,国势强盛,在国际上声望甚高,是亚洲各国经济文化交流的中心。随着国际交往的扩大,五台山还受到印度、日本、朝鲜和斯里兰卡等国佛教徒的景仰。朝礼五台山和到五台山求取佛经、佛法的外国僧侣很多。\n" +
        "　　五台山有浩如烟海的佛像,数量多达30000余尊,不仅有佛、菩萨、罗汉、胁侍、供养人、护法神,而且还有儒教、道教、地方宗教、帝王将相、僧侣居士等。这里的佛像分为八种类型:泥塑,金属,石刻,木雕,烧瓷,脱纱,刺绣,画像。";
        lvyou1="五台山位居中国四大佛教名山之首,称为“金五台”,为文殊菩萨的道场。五台山并非一座山,它是坐落于“华北屋脊”之上的一系列山峰群,景区总面积达2837平方公里,最高海拔3061米。五座山峰(东台望海峰、南台锦绣峰、中台翠岩峰、西台挂月峰、北台叶斗峰)环抱整片区域,顶无林木而平坦宽阔,犹如垒土之台,故而得名。五台山是中国唯一一个青庙(汉传佛教)黄庙(藏传佛教)交相辉映的佛教道场,因此汉蒙藏等民族在此和谐共处。五台山据传拥有寺庙128座,现存寺院共47处,台内39处,台外8处,其中多敕建寺院,多朝皇帝前来参拜。著名的有:显通寺、塔院寺、菩萨顶、南山寺、黛螺顶、广济寺、万佛阁等。\n" +
                "（一）奇峰灵崖\n" +
                "　　五台山奇峰灵崖随处皆是,著名者达五十余处。其中写字崖,用水洒湿以后,拿手帕仔细拭擦,崖面会显示出类似篆隶体字迹,水干字隐。有人曾除去表皮石层,结果下层仍能擦出字来。层层有字,字字不同。据载曾发现过“天之三宝日月星,地之三宝水火风,人之三宝精气神”的联句。\n" +
                "　　五台山方圆约320公里,因五峰如五根擎天巨柱拔地而起、巍然矗立,峰顶平坦如台,故名五台。又因山上气候多寒,盛夏仍不见炎暑,故又别称清凉山。是一个融自然风光、古建艺术、历史文物、佛教文化、民俗风情、避暑休养为一体的旅游区。1982年,五台山以山西五台山风景名胜区的名义,被国务院批准列入第一批国家级风景名胜区名单,历年来获得了“国家重点风景名胜区”、“中华十大名山”之一、“国家地质公园”、“国家自然与文化双遗产”、“国家AAAAA级旅游景区”、“世界遗产”等荣誉。\n" +
                "　　五台山由东西南北中五大高峰组成,据说代表着文殊菩萨的五种智慧:大圆镜智,妙观察智,平等性智,成所作智,法界体性智;以及五方佛:东方阿閦佛,西方阿弥陀佛,南方宝生佛,北方不空成就佛,中央毗卢遮那佛。\n" +
                "东台名望海峰,海拔2795米,东台顶上“蒸云浴日,爽气澄秋,东望明霞,如陂似镜,即大海也,”故冠此名。由于海拔高,台顶气温低,盛夏时节,仍须穿棉衣。中国佛协前会长赵朴初填词赞曰:“东台顶,盛夏尚披裘。天著霞衣迎日出,峰腾云海作舟浮,朝气满神州。\n" +
                "我的手机 2018/8/9 21:15:03\n" +
                "西台名挂月峰,海拔2773米,西台峰“顶广平,月坠峰巅,俨若悬镜,因以为名。”有诗赞曰:“西岭巍峨接远苍,回瞻乡国白云傍。孤峰岭翠连三晋,八水分流润四方。晴日野华铺蜀锦,秋风仙桂落天香。当年狮子曾遗迹,岩谷常浮五色光。”\n" +
                "南台名锦绣峰,海拔2485米,此峰“顶若覆盂,圆周一里,山峰耸峭,烟光凝翠,细草杂花,千峦弥布,犹铺锦然,故以名焉。”著名诗人元好问赋诗赞曰:“沈沈龙穴贮云烟,百草千花雨露偏。佛土休将人境比,谁家随步得金莲?”\n" +
                "北台名叶斗峰,海拔3061米,五台最高,有“华北屋脊”之称,其台“顶平广,圆周四里,其下仰视,巅摩斗杓,故以为名。”康熙皇帝赋诗赞曰:“绝磴摩群峭,高寒逼斗宫。钟鸣千嶂外,人语九霄中。朔雪晴犹积,春冰暖未融。凭虚看陆海,此地即方蓬。”\n" +
                "中台翠岩峰,海拔2894米,其台“顶广平,圆周五里,巅峦雄旷,翠霭浮空,因以为名。”有诗赞曰:“群峰面面拥奇观,朝雨和烟积翠峦。策杖千山浑不倦,披裘六月尚余寒。苍崖碧嶂周遭合,古木黄沙四望宽。云雾渐看山半起,却疑身已在云端。”";
        lvyou2="五台山现有建筑比较完整的寺院95处,其中国家重点文物保护单位6处:南禅寺、佛光寺、显通寺、广济寺、岩山寺(繁峙县)、洪福寺(定襄县);省级重点文物保护单位15处:塔院寺、菩萨顶、圆照寺、罗睺寺、殊像寺、碧山寺、南山寺、龙泉寺、金阁寺、尊胜寺、延庆寺、公主寺(繁峙县)、三圣寺(繁峙县)、惠济寺(原平市)、石佛堂(河北省阜平县);其余为县级重点文物保护单位。从宗教活动场所的角度,被公布为全国重点寺院的有11处:显通寺、塔院寺、菩萨顶、罗睺寺、殊像寺、碧山寺、金阁寺、广宗寺、广仁寺、黛螺顶、观音洞。\n" +
                "　　五台山佛教组织以寺院为单位,按佛教传承之不同,寺院分为青庙和黄庙。青庙亦称和尚庙,僧侣大都为汉族,一般穿青灰色僧衣,称青衣僧。五台山大部分寺院属于青庙。青庙中又有十方庙和子孙庙之分。子孙庙按师徒关系实行家传制,外寺僧人不得在本寺担任职事。历史上五台山青庙多属子孙庙。十方庙可以接待四方来僧,在寺僧人亦可十方云游,组织管理实行选贤制。根据中国佛教协会颁布的《汉传佛教寺院管理办法》,原来的子孙庙均已不实行家传制而改行选贤制,子孙庙和十方庙已无明显的分别。\n" +
                "　　黄庙亦称喇嘛庙,属于藏传佛教。五台山藏传佛教均属宗喀巴大师创立的格鲁派,信教喇嘛均穿黄衣,戴黄帽,称黄衣僧。明永乐年间,五台山始有青庙改成黄庙。清康熙时,敕令将罗睺寺、寿宁寺、三泉寺、玉花池、七佛寺、金刚窟、善财洞、普庵寺、台麓寺、涌泉寺等10寺改为黄庙。于是,青衣僧改为黄衣僧,汉喇嘛由此产生。五台山有黄庙8处,即菩萨顶、罗睺寺、广仁寺、万佛阁、镇海寺、广化寺、观音洞、上善财洞。\n";
        lvyou3="1、跳布扎\n" +
                "　　跳布扎是每年的农历六月十五前后,起源于西藏,是五台山黄教举行的重大佛事活动。在活动前一天,寺内喇嘛就开始念护法经,跳金刚舞,在菩萨顶“镇鬼”;十五日,百余名有身份的喇嘛走出菩萨顶,穿街绕巷,最前边架着弥勒菩萨像,其后大喇嘛坐轿,二喇嘛骑马,其余僧众吹奏庙堂音乐,浩浩荡荡的往罗睺寺去“跳神”;十六日,又在菩萨顶“斩鬼”,大、二喇嘛穿戴皇赐服饰,外列僧人头戴面具装扮28宿,就地画圆,按圆行步,并辅以身形手势。通过此活动以驱除邪恶,迎来吉祥安泰。\n" +
                "2、骡马大会\n" +
                "　　每年农历六月举办,期间举行大型佛事活动、民间文化活动、骡马牲畜交易大会。朝会活动内容丰富,其主要一项是四方僧侣云集台怀镇做道场、诵经,使五台山充满了神秘的宗教色彩。\n" +
                "3、五台山佛教文化节\n" +
                "　　五台山是文殊菩萨的道场,终年香火缭绕、梵音不断,宗教气氛浓厚。每年8月,这里举行盛大的旅游节庆——“五台山佛教文化节”,届时各方宾客和僧众云集,举行盛大的佛事活动,盛况空前。期间举行大型佛事活动、民间文艺活动。\n" +
                "4、其他\n" +
                "　　九项特色旅游活动:佛国圣地采摘游、朝台登山健身游、佛教文艺欣赏游、镇海松涛红叶游、秋冬美景摄影游、金色世界生态游、银色五台踏雪游、寺庙法会祈福游、佛法禅宗探访游。\n" +
                "5、美食\n" +
                "　　五台山地区有许多独具特色的菜肴和风味小吃,在这里可以品尝到肉片炝香蘑、清炒台蘑、小鸡炖台蘑等传统名菜,口味清香而不油腻。\n" +
                "6、过年\n" +
                "　　“五台山上过大年”受到了海内外佛教界、旅游界等社会各界的欢迎与青睐,北京、广东、福建等地的游客信士把五台山当作度假首选乐园,不仅有效地继承和弘扬了区域文化,更重要的是拓展了五台山冬季旅游发展新路。\n" +
                "　　自2002年五台山首届佛俗民情年成功举办以来,五台山景区已经连续如期举行了十届该项活动。活动集中展示佛教圣地禅门僧尼过年习俗和特有的地方“两节”风情的创意,极大迎合了很多中国人“逃离”紧张而喧闹的城市生活、追寻古朴而纯正的过年过节情趣的心理需求。\n";
                lishichuanshuo1="中国有四大佛教名山,它们分别是五台山、峨嵋山、普陀山、九华山,传说这四座山分别是佛教中四大菩萨文殊、普贤、观音、地藏的修行地,因此都有悠久的宗教文化渊源,同时它们也是中国著名的风景名胜区。\n" +
                        "　　五台山位于中国中部山西省境内,由五座山峰环抱而成。五座山峰的顶端平坦宽阔,好象土砌的平台,分别称为东台、西台、南台、北台、中台,合称“五台”。五台山是华北的海拔最高点。\n" +
                        "　　相传五台山原名五峰山,气候异常恶劣,冬天滴水成冰,春天飞沙走石,夏天酷热难当,农民们根本无法到田里种庄稼。文殊菩萨碰巧到这里传教,看到人们遭受苦难,决定改变这里的气候。\n";
                lishichuanshuo2= "文殊菩萨了解到东海龙王那里有一块神石叫“歇龙石”,可以把干燥的气候变得湿润,于是变成一个化缘的和尚,到龙王那里借歇龙石。\n" +
                        "　　文殊菩萨来到东海,见龙宫外面果然有一块巨石。还没有走到跟前,已经感觉到一股凉气迎面扑来。文殊菩萨见到龙王,说明来意。龙王很抱歉地说:“大法师借什么都行,唯独这块歇龙石不能借。因为它是花了几百年工夫从海底打捞上来的,清凉异常,龙子们每天工作回来,汗水淋漓,燥热难耐,便在上面歇息养神,你若借去,龙子们就没有歇息的地方了。”文殊菩萨反复说明自己是五峰山的和尚,是为了造福于人间特地来求援的。\n";
                lishichuanshuo3="龙王心里不愿意把神石借人,又不便直接回绝文殊菩萨的请求。估计这位老和尚一人无法将石头运走,龙王勉强答应说:“神石很重,没有人能帮助你,你如果能拿得动,就拿走吧!”\n" +
                        "　　文殊菩萨谢过龙王,走到神石跟前,口念咒语,立刻使巨石变成了小小的弹丸。文殊菩萨将弹丸塞进袖筒,然后飘然而去。老龙王惊得目瞪口呆,后悔莫及。\n" +
                        "　　文殊菩萨回到五峰山时,正是烈日当空,因为久旱不雨,大地干裂,人们遭受着深深的苦难。文殊菩萨把神石安放在山中间的一条山谷中,奇迹发生了:五峰山立刻变成一个清凉无比的天然牧场。于是,这条山谷被命名为清凉谷,人们又在这里建了一座寺院,起名叫清凉寺,五峰山也改名叫作清凉山了。\n";
                cankaozilaio1="1.生根活佛著作《皈依》正式出版. .雍仲本波佛教网..2014-11-24[引用日期2015-12-20]\n" +
                        "2.图说山西“山” .山西省农业厅[引用日期2013-08-26]五台山世界文化景观 .\n" +
                        "3.山西省人民政府[引用日期2013-08-26]\n" +
                        "4.五台山-佛教四大名山之一 .中国寺庙网[引用日期2013-08-26]\n" +
                        "5.五台山 .人民网[引用日期2013-08-26]\n" +
                        "6.佛教四大名山中的道教文化现象初探\n" +
                        "7.山西五台山 .风景网[引用日期2013-08-26]、\n" +
                        "8.生根活佛传记如意宝镜 .佛缘网站.2013-02-16[引用日期2014-11-19]\n" +
                        "9.五台山虔诚之旅仰望佛教圣地的传说[图] .中国网[引用日期2013-08-26]\n" +
                        "10.五台山虔诚之旅仰望佛教圣地的传说[图] .中国网[引用日期2013-08-26]\n" +
                        "11.五台山虔诚之旅仰望佛教圣地的传说[图] .中国网[引用日期2013-08-26]\n" +
                        "12.五台山虔诚之旅仰望佛教圣地的传说[图] .中国网[引用日期2013-08-26]\n" +
                        "13.五台山虔诚之旅仰望佛教圣地的传说[图] .中国网[引用日期2013-08-26]\n" +
                        "14.五台山虔诚之旅仰望佛教圣地的传说[图] .中国网[引用日期2013-08-26]\n" +
                        "15.五台山虔诚之旅仰望佛教圣地的传说[图] .中国网[引用日期2013-08-26]\n" +
                        "16.五台山历史 .中国民族宗教网[引用日期2013-08-26]\n" +
                        "17.五台山 .中国园林网[引用日期2013-08-26]\n" +
                        "18.南禅寺五台山最古老的寺院 .中国园林网[引用日期2013-08-26]\n" +
                        "19.五台山的节庆与佛事活动 .佛教导航[引用日期2013-08-26]\n" +
                        "20.中国·五台山第四届国际文化旅游月圆满闭幕 中国民族报社[引用日期2013-08-26]\n" +
                        "21.十一黄金周:五忻高速通车“提速”五台山旅游 ·人民网[引用日期2013-08-26]\n" +
                        "22.五台山景区美食 .搜狐[引用日期2013-08-26]\n" +
                        "23.到五台山上过大年 .人民网[引用日期2013-08-26]\n" +
                        "24.山西五台山龙年佛俗民情年拉开帷幕 .中新网[引用日期2013-08-26]\n" +
                        "25.五台山的传说故事 .中国历史故事网.2013-11-26[引用日期2014-05-23]\n";















    }
    public void setview(){

    }

    @Override
    public void onClick(View v) {
        switch (v.getId()){
            case R.id.zongjianjie:
                setvisib();
                 title1 = "五台山简介";
                  img3.setVisibility(View.GONE);
                 title.setText(title1);
                 content1.setText(wutai1);
                 conten2.setText(wutai2);
                 conten3.setText(wutai3);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.wutai_jianjie1).into(img1);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.wutai_jianjie2).into(img2);
                break;
            case R.id.qihoutedian:
                setvisib();
                title1 = "气候特点";
                img2.setVisibility(View.GONE);
                img3.setVisibility(View.GONE);
                  conten3.setVisibility(View.GONE);
                title.setText(title1);
                content1.setText(qihou1);
                conten2.setText(qihou2);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.qihoujianjie).into(img1);
                break;
            case R.id.lishiyange:
                setvisib();
                title1 = "历史沿革";
                img3.setVisibility(View.GONE);
                title.setText(title1);
                content1.setText(lishiyange1);
                conten2.setText(lishiyange2);
                conten3.setText(lishiyange3);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.lishiyangejianjie).into(img1);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.lishiyangejianjie2).into(img2);
                break;
            case R.id.ziranziyuan:
                setvisib();
                title1 = "自然资源";
                img3.setVisibility(View.GONE);
                conten3.setVisibility(View.GONE);
                img2.setVisibility(View.GONE);
                title.setText(title1);
                content1.setText(ziran1);
                conten2.setText(ziran2);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.ziran1).into(img1);
                break;
            case R.id.renwenlishi:
                setvisib();
                title1 = "人文历史";
                img3.setVisibility(View.GONE);
                title.setText(title1);
                content1.setText(renewn1);
                conten2.setText(renwen2);
                conten3.setText(renwen3);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.renewn).into(img1);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.renewn1).into(img2);
                break;
            case R.id.lvyouxinxi:
                setvisib();
                title1 = "旅游信息";
                img3.setVisibility(View.GONE);
                title.setText(title1);
                content1.setText(lvyou1);
                conten2.setText(lvyou2);
                conten3.setText(lvyou3);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.lvyou1).into(img1);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.lvyou2).into(img2);
                break;
            case R.id.lishichuanshuo:
                setvisib();
                title1 = "历史传说";
                img3.setVisibility(View.GONE);

                title.setText(title1);

                content1.setText(lishichuanshuo1);
                conten2.setText(lishiyange2);
                conten3.setText(lishichuanshuo3);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.lishichuanshuo1).into(img1);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.lsihichuanshuo).into(img2);
                break;
            case R.id.cankaoziliao:
                setvisib();
                title1 = "参考资料";
                conten3.setVisibility(View.GONE);
                conten2.setVisibility(View.GONE);
                img1.setVisibility(View.GONE);
                img2.setVisibility(View.GONE);
                img3.setVisibility(View.GONE);
                title.setText(title1);
                content1.setText(cankaozilaio1);

                break;
            case R.id.dizhidimao:
                setvisib();
                title1 = "地质地貌";
                img3.setVisibility(View.GONE);
                title.setText(title1);
                content1.setText(dizhi1);
                conten2.setText(dizhi2);
                conten3.setText(dizhi3);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.jianjie_dizhi1).into(img1);
                Glide.with(Wutaijianjie_activity.this).load(R.drawable.jianjie_dizhi2).into(img2);
                break;
        }
    }
}
